/************************************************************
 * 版权：2025CIMC Copyright。 
 * 文件：adc.h
 * 作者: Lingyu Meng
 * 平台: 2025CIMC IHD-V04
 * 版本: Lingyu Meng     2025/03/07     V0.01    original
************************************************************/

#ifndef __ADC_H
#define __ADC_H

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/

void ADC_port_init(void); //adc端口初始化
void ADC_Init(void);     //  ADC 初始化
uint16_t ADC_ReadRaw(void);       // 读取ADC原始值
uint32_t ADC_ReadMillivolt(void); // 读取ADC电压，单位mV
				    
#endif


/****************************End*****************************/

